## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group will be created
  + resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
      + arn         = (known after apply)
      + description = "Parameter group for ai-answers production DocumentDB"
      + family      = "docdb5.0"
      + id          = (known after apply)
      + name        = "ai-answers-production-docdb-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
    }

  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be created
  + resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
      + arn         = (known after apply)
      + description = "Subnet group for DocumentDB for the ai-answers production app"
      + id          = (known after apply)
      + name        = "ai-answers-production-docdb-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-03c051206642ed328",
          + "subnet-0f172291e07a56e1d",
        ]
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_security_group.ai-answers-docdb-sg will be created
  + resource "aws_security_group" "ai-answers-docdb-sg" {
      + arn                    = (known after apply)
      + description            = "Security group for DocumentDB for the ai-answers production app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ai-answers-production-docdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-006a4fac589012225"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_docdb_security_group_id = (known after apply)
[0;90m18:59:20.260[0m [0;33mWARN  [0m Config ../ssm/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.

Error: reading SSM Parameter (docdb_username): couldn't find resource

  with data.aws_ssm_parameter.docdb_username,
  on documentdb.tf line 6, in data "aws_ssm_parameter" "docdb_username":
   6: data "aws_ssm_parameter" "docdb_username" {


Error: reading SSM Parameter (docdb_password): couldn't find resource

  with data.aws_ssm_parameter.docdb_password,
  on documentdb.tf line 10, in data "aws_ssm_parameter" "docdb_password":
  10: data "aws_ssm_parameter" "docdb_password" {

[0;90m18:59:31.343[0m [0;31mERROR [0m terraform invocation failed in ./.terragrunt-cache/954bzlnFUpJEyWl9QonYlNuEs5Y/HZ1Dre01zncVe6gY3u5Io4to-Mc/database
[0;90m18:59:31.343[0m [0;31mERROR [0m error occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in ./.terragrunt-cache/954bzlnFUpJEyWl9QonYlNuEs5Y/HZ1Dre01zncVe6gY3u5Io4to-Mc/database
  
  Error: reading SSM Parameter (docdb_username): couldn't find resource
  
    with data.aws_ssm_parameter.docdb_username,
    on documentdb.tf line 6, in data "aws_ssm_parameter" "docdb_username":
     6: data "aws_ssm_parameter" "docdb_username" {
  
  
  Error: reading SSM Parameter (docdb_password): couldn't find resource
  
    with data.aws_ssm_parameter.docdb_password,
    on documentdb.tf line 10, in data "aws_ssm_parameter" "docdb_password":
    10: data "aws_ssm_parameter" "docdb_password" {
  
  
  exit status 1


```

</details>

